In [80]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

In [4]:
obj = pd.Series([4, 7, -5, 3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj2 = pd.Series([4, 6, -5, 3], index= ['d','b','a','c'])

In [7]:
obj2

d    4
b    6
a   -5
c    3
dtype: int64

In [8]:
obj2['a']

-5

In [9]:
obj2['d'] = 6

In [10]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [11]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
obj3 = pd.Series(sdata)

In [13]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [14]:
obj4 = pd.Series(sdata, index=states)

In [15]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [16]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [23]:
obj4.name = 'population'

In [24]:
obj4.index.name = 'state'

In [25]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [26]:
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'year':[2000, 2001, 2002, 2001, 2002, 2003],
       'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [27]:
frame = pd.DataFrame(data)

In [28]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [29]:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [30]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index=['one','two','three','four','five','six'])

In [31]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [33]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [34]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [35]:
frame2['debt'] = 16.5

In [36]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [39]:
frame2['debt'] = np.arange(6.)

In [38]:
import numpy as np

In [40]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [41]:
val = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])

In [42]:
frame2['debt'] = val

In [43]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [44]:
pop = {'Navada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [45]:
frame3 = pd.DataFrame(pop)

In [47]:
frame3

      Navada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [48]:
frame3.T

        2000  2001  2002
Navada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [55]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [56]:
frame3

state  Navada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [57]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [58]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [59]:
obj = pd.Series(range(3), index = ['a','b','c'])

In [60]:
index = obj.index

In [61]:
index

Index(['a', 'b', 'c'], dtype='object')

In [62]:
index[1:]

Index(['b', 'c'], dtype='object')

In [63]:
labels = pd.Index(np.arange(3))

In [64]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [65]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)

In [66]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [67]:
obj2.index is labels

True

In [68]:
frame3

state  Navada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [69]:
frame3.columns

Index(['Navada', 'Ohio'], dtype='object', name='state')

In [70]:
'Ohio' in frame3.columns

True

In [71]:
2003 in frame3.index

False

In [72]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [74]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [83]:
obj = pd.Series([4.5,7.2, -5.3, 3.6], index = ['d','b','a','c'])

In [84]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [77]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [78]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [81]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])

In [82]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [85]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [87]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a','c','d'],
                     columns = ['Ohio','Texas','California'])

In [88]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [89]:
frame2 = frame.reindex(['a','b','c','d'])

In [90]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [91]:
states = ['Texas', 'Utah', 'California']

In [92]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [93]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])

In [94]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [95]:
new_obj = obj.drop('c')

In [96]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [97]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [98]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     columns =['one','two','three','four'],
                     index = ['Ohio','Texas','California','New York'])

In [99]:
data

            one  two  three  four
Ohio          0    1      2     3
Texas         4    5      6     7
California    8    9     10    11
New York     12   13     14    15

In [100]:
data.drop(['Ohio','Texas'])

            one  two  three  four
California    8    9     10    11
New York     12   13     14    15

In [101]:
data.drop('two', axis=1)

            one  three  four
Ohio          0      2     3
Texas         4      6     7
California    8     10    11
New York     12     14    15

In [102]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])

In [103]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [104]:
obj['b']

1.0

In [105]:
obj[1]

1.0

In [106]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [108]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [109]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [110]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [111]:
obj['b':'c'] = 5

In [112]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [114]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     columns =['one','two','three','four'],
                     index = ['Ohio','Colorado','Utah','New York'])

In [115]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [116]:
data.loc['Colorado', ['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [117]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [118]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [119]:
df = pd.DataFrame([[1.4, np.nan],[7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],index = ['a','b','c','d'], columns=['one','two'])

In [120]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [121]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [122]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [123]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [124]:
df.idxmax()

one    b
two    d
dtype: object

In [125]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [126]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [127]:
import pandas_datareader.data as web

In [128]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL','IBM', 'MSFT', 'GOOG']}

In [129]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})

In [130]:
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [131]:
returns = price.pct_change()

In [132]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2018-09-17 -0.026626 -0.002629 -0.010849 -0.014055
2018-09-18  0.001652  0.004191  0.009542  0.004472
2018-09-19  0.000596  0.003366 -0.013338  0.008500
2018-09-20  0.007602  0.014021  0.016741  0.013475
2018-09-24 -0.000455 -0.008535  0.007837 -0.015082

    # The corr method of series computs the correlation of overlapping nom-NA aligned-by-index
    cov computes the covariance.

In [133]:
returns['MSFT'].corr(returns['IBM'])

0.4727054262147791

In [134]:
returns['MSFT'].cov(returns['IBM'])

7.964671476592481e-05

In [135]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.361730  0.413469  0.429780
IBM   0.361730  1.000000  0.472705  0.395015
MSFT  0.413469  0.472705  1.000000  0.508000
GOOG  0.429780  0.395015  0.508000  1.000000